LastenUndPflichtenheft.html
<!DOCTYPE html>
<html lang="de">
<head>
<meta charset="utf-8"/>
<title>Lasten- und Pflichtenheft</title>
<meta name="author" content="Sebastian Meisel"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/league.css" id="theme"/>

<link rel="stylesheet" href="./mystyle.css"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Lasten- und Pflichtenheft</h1><p class="subtitle">KOM-ITIL</p>
<h2 class="author">Sebastian Meisel</h2>
</section>

<section>
<section id="slide-orga118a7e">
<h2 id="orga118a7e">Einführung</h2>
<p>
In der IT-Branche ist eine klare und strukturierte Kommunikation zwischen Auftraggebern und Auftragnehmern essenziell, um Projekte erfolgreich umzusetzen. Hierbei spielen das Lastenheft und das Pflichtenheft eine zentrale Rolle. Diese Dokumente definieren Anforderungen und Aufgaben und dienen als Grundlage für die gesamte Projektarbeit.
</p>

</section>
</section>
<section>
<section id="slide-org13a2a13">
<h2 id="org13a2a13">Begriffsdefinitionen</h2>
<div class="outline-text-2" id="text-org13a2a13">
</div>
</section>
</section>
<section>
<section id="slide-org358a7b6">
<h3 id="org358a7b6">Lastenheft</h3>
<div class="tolearn" id="org9dbcac7">
<p>
Das Lastenheft beschreibt die Anforderungen des Auftraggebers an das System oder die Dienstleistung. Es stellt dar, <b>was</b> erreicht werden soll, ohne vorzugeben, <b>wie</b> es umgesetzt werden soll. Es stellt die Grundlage einer Ausschreibung dar.
</p>

</div>

</section>
<section id="slide-org6ecf633">
<h4 id="org6ecf633">Inhalte des Lastenhefts</h4>
<ul>
<li>Zielsetzung des Projekts</li>
<li>Beschreibung der Ausgangssituation</li>
<li>Funktionale Anforderungen</li>
<li>Nicht-funktionale Anforderungen</li>
<li>Schnittstellen zu anderen Systemen</li>
<li>Rahmenbedingungen (z.B. Budget, Zeitplan)</li>

</ul>

<aside class="notes">
<p>
Funktionale und nicht-funktionale Anforderungen sind zwei grundlegende Kategorien, die bei der Spezifikation eines Systems oder einer Software verwendet werden. Sie definieren, was das System tun soll (funktional) und wie es diese Aufgaben ausführen soll (nicht-funktional).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Merkmal</th>
<th scope="col" class="org-left">Funktionale Anforderungen</th>
<th scope="col" class="org-left">Nicht-funktionale Anforderungen</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Beschreibung</td>
<td class="org-left">Was das System leisten muss</td>
<td class="org-left">Wie das System diese Leistungen erbringt</td>
</tr>

<tr>
<td class="org-left">Beispiel aus der IT</td>
<td class="org-left">Benutzer kann ein Produkt suchen</td>
<td class="org-left">Suche muss Ergebnisse in weniger als 2 Sekunden liefern</td>
</tr>

<tr>
<td class="org-left">Prüfmethoden</td>
<td class="org-left">Funktionstests, Use-Case-Tests</td>
<td class="org-left">Performance-Tests, Sicherheitsaudits</td>
</tr>

<tr>
<td class="org-left">Fokus</td>
<td class="org-left">Fachliche und technische Funktionen</td>
<td class="org-left">Qualität, Effizienz, Sicherheit, Skalierbarkeit</td>
</tr>
</tbody>
</table>

<p>
Funktionale und nicht-funktionale Anforderungen ergänzen sich:
</p>

<p>
Ohne funktionale Anforderungen weiß man nicht, was das System tun soll.
Ohne nicht-funktionale Anforderungen bleibt unklar, wie gut das System dies leisten muss.
</p>

<p>
Ein Beispiel zur Verdeutlichung:
</p>

<p>
Funktional: „Die Anwendung muss eine Benutzeranmeldung bereitstellen.“
Nicht-funktional: „Die Anmeldung muss innerhalb von 2 Sekunden abgeschlossen sein und Sicherheitsstandards wie 2FA (Zwei-Faktor-Authentifizierung) einhalten.“
</p>

<p>
Beide zusammen sorgen für ein vollständig definiertes und qualitativ hochwertiges System.
</p>

</aside>

</section>
<section id="slide-org4d2065b">
<h4 id="org4d2065b">Beispiel: IT-Anwendungsentwicklung</h4>
<p>
Ein Unternehmen möchte eine neue Webanwendung entwickeln lassen. Im Lastenheft könnte stehen:
</p>
<ul>
<li>Die Anwendung soll eine Benutzerregistrierung und -anmeldung ermöglichen.</li>
<li>Es soll eine Produktsuche mit Filterfunktionen geben.</li>
<li>Die Anwendung muss in deutscher und englischer Sprache verfügbar sein.</li>
<li>Datenschutzanforderungen gemäß DSGVO sind einzuhalten.</li>

</ul>

</section>
</section>
<section>
<section id="slide-org0a0afd5">
<h3 id="org0a0afd5">Pflichtenheft</h3>
<div class="tolearn" id="org5fb5baa">
<p>
Das Pflichtenheft wird vom Auftragnehmer erstellt und beschreibt detailliert, <b>wie</b> die Anforderungen des Lastenhefts umgesetzt werden. Es ist eine technische Konkretisierung und dient als Basis für die Umsetzung. Es stellt die rechtsverbindliche Grundlage des Vertrages dar.
</p>

</div>

</section>
<section id="slide-org1a2c924">
<h4 id="org1a2c924">Inhalte des Pflichtenhefts</h4>
<ul>
<li>Konkrete technische Umsetzung der Anforderungen</li>
<li>Detaillierte Systemarchitektur</li>
<li>Entwicklungsumgebung und Werkzeuge</li>
<li>Teststrategie und Qualitätssicherungsmaßnahmen</li>
<li>Zeitplan für die einzelnen Projektphasen</li>

</ul>

</section>
<section id="slide-org0310d3c">
<h4 id="org0310d3c">Beispiel: Systemadministration</h4>
<p>
Ein Unternehmen möchte eine neue Server-Infrastruktur implementieren. Im Pflichtenheft könnte stehen:
</p>
<ul>
<li>Der Server wird auf Basis von Ubuntu Linux 22.04 LTS installiert.</li>
<li>Die Benutzerverwaltung erfolgt über LDAP.</li>
<li>Backups werden mittels BorgBackup auf ein dediziertes NAS durchgeführt.</li>
<li>Ein Monitoring-System (z.B. Prometheus) wird zur Überwachung eingerichtet.</li>
<li>Firewall-Regeln werden über UFW konfiguriert.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgd96ac4c">
<h2 id="orgd96ac4c">Vergleich und Abgrenzung</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Merkmal</th>
<th scope="col" class="org-left">Lastenheft</th>
<th scope="col" class="org-left">Pflichtenheft</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Verfasser</td>
<td class="org-left">Auftraggeber</td>
<td class="org-left">Auftragnehmer</td>
</tr>

<tr>
<td class="org-left">Inhalt</td>
<td class="org-left">Anforderungen und Ziele</td>
<td class="org-left">Technische Umsetzung</td>
</tr>

<tr>
<td class="org-left">Zeitpunkt</td>
<td class="org-left">Vor Projektstart</td>
<td class="org-left">Nach Freigabe des Lastenhefts</td>
</tr>

<tr>
<td class="org-left">Zweck</td>
<td class="org-left">Grundlage für Angebote und Vertragsgestaltung</td>
<td class="org-left">Grundlage für die Umsetzung und Dokumentation</td>
</tr>
</tbody>
</table>

</section>
</section>
<section>
<section id="slide-org4c5eef1">
<h2 id="org4c5eef1">Vorteile und Herausforderungen</h2>
<div class="outline-text-2" id="text-org4c5eef1">
</div>
</section>
</section>
<section>
<section id="slide-org48bc7d4">
<h3 id="org48bc7d4">Vorteile</h3>
<ul>
<li>Klare Definition von Anforderungen verhindert Missverständnisse.</li>
<li>Nachvollziehbarkeit der Projektphasen durch saubere Dokumentation.</li>
<li>Grundlage für Tests und Abnahmen.</li>

</ul>

</section>
</section>
<section>
<section id="slide-org77a2828">
<h3 id="org77a2828">Herausforderungen</h3>
<ul>
<li>Erheblicher Zeitaufwand bei der Erstellung.</li>
<li>Mögliche Unklarheiten bei der Interpretation von Anforderungen.</li>
<li>Gefahr der Überladung durch zu viele Details.</li>

</ul>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom/zoom.js"></script>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js"></script>


<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
plugins: [RevealMarkdown, RevealZoom, RevealNotes]
});

</script>
</body>
</html>
